MBriad/openCVandSTM32/stm32_project/System/Timer.c
#include "stm32f10x.h"                  // Device header
extern uint16_t Num;
void Timer_Init( void ) {
		RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM2, ENABLE);
		
		TIM_InternalClockConfig(TIM2);
		
		TIM_TimeBaseInitTypeDef TIM_TimeBaseTnitStruct;
		TIM_TimeBaseTnitStruct.TIM_ClockDivision = TIM_CKD_DIV1;
		TIM_TimeBaseTnitStruct.TIM_CounterMode = TIM_CounterMode_Up;
		TIM_TimeBaseTnitStruct.TIM_Period = 10000-1;
		TIM_TimeBaseTnitStruct.TIM_Prescaler = 7200-1;
		TIM_TimeBaseTnitStruct.TIM_RepetitionCounter = 0;
		TIM_TimeBaseInit(TIM2, &TIM_TimeBaseTnitStruct);
		
		TIM_ClearFlag(TIM2, TIM_FLAG_Update);
		TIM_ITConfig(TIM2, TIM_IT_Update, ENABLE);
		
		NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2);
		NVIC_InitTypeDef NVIC_InitStructure;
		NVIC_InitStructure.NVIC_IRQChannel = TIM2_IRQn;
		NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
		NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 1;
		NVIC_InitStructure.NVIC_IRQChannelSubPriority = 2;
		NVIC_Init(&NVIC_InitStructure);
		
		TIM_Cmd(TIM2, ENABLE);
}
uint16_t Timer_GetCounter(void)
{
	return TIM_GetCounter(TIM2);	
}
/*
void TIM2_IRQHandler(void)
{
	if (TIM_GetITStatus(TIM2, TIM_IT_Update) == SET)
	{
		
		TIM_ClearITPendingBit(TIM2, TIM_IT_Update);
	}
}
*/